// let str = '';
// for (let i = 20; i <= 30; i = i + 0.5) {
//    str = str + i + ' ';
// }
// console.log(str);

// -------------------------------------------------------------

// let str = '';
// for (let i = 10; i <= 100; i = i + 10) {
//    str = str + i * 27 + ' ';
// }
// console.log(str);

// -------------------------------------------------------------

// let n = +prompt('Введите число', '0');
// let str = '';
// for (let i = 1; i <= n; i++) {
//    str = i * i + ' ';
//    console.log(str);
// }


// -------------------------------------------------------------

// function getNumber(n) {
//    for (let i = 2; i < n; i++) {
//       if (n % i === 0) {
//          return 'Составное число';
//       }
//       return 'Простое число';
//    }
// }
// console.log(getNumber(+prompt('Введите число', '0')));

// -------------------------------------------------------------

// let n = +prompt('Введите число', '0');
// while (n % 3 === 0) {
//    n = n / 3;
// }
// console.log(
//    n === 1 ? 'Можно' : 'Нельзя'
// );